MikroElektronika/core_packages/ARM/gcc_clang/system/src/nxp/mkm34z/thirdparty/mkm34z/periph/PERI_XBAR.h
#define XBAR_SEL6_SEL12_MASK                     (0x3FU)
#define XBAR_SEL6_SEL12_SHIFT                    (0U)
/*! SEL12
 *  0b000000..Logic 1 (VDD)
 *  0b000001..Logic 0 (VSS)
 *  0b000010..AFE modulator clock output
 *  0b000011..AFE modulator 0 data output
 *  0b000100..LPTimer Output
 *  0b000101..Clock Output
 *  0b000110..Quad Timer channel 0 output
 *  0b000111..Quad Timer channel 1 output
 *  0b001000..Quad Timer channel 2 output
 *  0b001001..Quad Timer channel 3 output
 *  0b001010..iRTC Clock Output
 *  0b001011..CMP0 Output
 *  0b001100..CMP1 Output
 *  0b001101..iRTC Alarm Output
 *  0b001110..UART TX Output (after modulation)
 *  0b001111..EWM Output (EWM_OUT)
 *  0b010000..PIT 0 Timer Interrupt Flag 0 (Timeout 0)
 *  0b010001..XBAR Input pin 0
 *  0b010010..XBAR Input pin 1
 *  0b010011..XBAR Input pin 2
 *  0b010100..XBAR Input pin 3
 *  0b010101..XBAR Input pin 4
 *  0b010110..XBAR Input pin 5
 *  0b010111..XBAR Input pin 6
 *  0b011000..XBAR Input pin 7
 *  0b011001..XBAR Input pin 8
 *  0b011010..ORed conversion complete flag for all SAR ADC channels
 *  0b011011..ORed conversion complete flag for all AFE channels
 *  0b011100..AFE Channel 0 conversion complete
 *  0b011101..AFE Channel 1 conversion complete
 *  0b011110..AFE Channel 2 conversion complete
 *  0b011111..AFE Channel 3 conversion complete
 *  0b100000..DMA Done Signal
 *  0b100001..XBAR Input pin 9
 *  0b100010..XBAR Input pin 10
 *  0b100011..CMP2 Output
 *  0b100100..PIT 0 Timer Interrupt Flag 1 (Timeout 1)
 *  0b100101..PIT 1 Timer Interrupt Flag 0 (Timeout 0)
 *  0b100110..PIT 1 Timer Interrupt Flag 1 (Timeout 1)
 *  0b100111..AFE modulator 1 data output
 *  0b101000..AFE modulator 2 data output
 *  0b101001..AFE modulator 3 data output
 *  0b101010..SAR ADC conversion complete A
 *  0b101011..SAR ADC conversion complete B
 *  0b101100..SAR ADC conversion complete C
 *  0b101101..SAR ADC conversion complete D
 *  0b101110..PDB0 CH0 Pre-trigger 0
 *  0b101111..PDB0 CH0 Pre-trigger 1
 *  0b110000..PDB0 CH0 Pre-trigger 2
 *  0b110001..PDB0 CH0 Pre-trigger 3
 *  0b110010..PDB0 CH0 Trigger
 *  0b110011..PDB0 Pulse-Out 0
 */
#define XBAR_SEL6_SEL12(x)                       (((uint16_t)(((uint16_t)(x)) << XBAR_SEL6_SEL12_SHIFT)) & XBAR_SEL6_SEL12_MASK)

#define XBAR_SEL6_SEL13_MASK                     (0x3F00U)
#define XBAR_SEL6_SEL13_SHIFT                    (8U)
/*! SEL13
 *  0b000000..Logic 1 (VDD)
 *  0b000001..Logic 0 (VSS)
 *  0b000010..AFE modulator clock output
 *  0b000011..AFE modulator 0 data output
 *  0b000100..LPTimer Output
 *  0b000101..Clock Output
 *  0b000110..Quad Timer channel 0 output
 *  0b000111..Quad Timer channel 1 output
 *  0b001000..Quad Timer channel 2 output
 *  0b001001..Quad Timer channel 3 output
 *  0b001010..iRTC Clock Output
 *  0b001011..CMP0 Output
 *  0b001100..CMP1 Output
 *  0b001101..iRTC Alarm Output
 *  0b001110..UART TX Output (after modulation)
 *  0b001111..EWM Output (EWM_OUT)
 *  0b010000..PIT 0 Timer Interrupt Flag 0 (Timeout 0)
 *  0b010001..XBAR Input pin 0
 *  0b010010..XBAR Input pin 1
 *  0b010011..XBAR Input pin 2
 *  0b010100..XBAR Input pin 3
 *  0b010101..XBAR Input pin 4
 *  0b010110..XBAR Input pin 5
 *  0b010111..XBAR Input pin 6
 *  0b011000..XBAR Input pin 7
 *  0b011001..XBAR Input pin 8
 *  0b011010..ORed conversion complete flag for all SAR ADC channels
 *  0b011011..ORed conversion complete flag for all AFE channels
 *  0b011100..AFE Channel 0 conversion complete
 *  0b011101..AFE Channel 1 conversion complete
 *  0b011110..AFE Channel 2 conversion complete
 *  0b011111..AFE Channel 3 conversion complete
 *  0b100000..DMA Done Signal
 *  0b100001..XBAR Input pin 9
 *  0b100010..XBAR Input pin 10
 *  0b100011..CMP2 Output
 *  0b100100..PIT 0 Timer Interrupt Flag 1 (Timeout 1)
 *  0b100101..PIT 1 Timer Interrupt Flag 0 (Timeout 0)
 *  0b100110..PIT 1 Timer Interrupt Flag 1 (Timeout 1)
 *  0b100111..AFE modulator 1 data output
 *  0b101000..AFE modulator 2 data output
 *  0b101001..AFE modulator 3 data output
 *  0b101010..SAR ADC conversion complete A
 *  0b101011..SAR ADC conversion complete B
 *  0b101100..SAR ADC conversion complete C
 *  0b101101..SAR ADC conversion complete D
 *  0b101110..PDB0 CH0 Pre-trigger 0
 *  0b101111..PDB0 CH0 Pre-trigger 1
 *  0b110000..PDB0 CH0 Pre-trigger 2
 *  0b110001..PDB0 CH0 Pre-trigger 3
 *  0b110010..PDB0 CH0 Trigger
 *  0b110011..PDB0 Pulse-Out 0
 */
#define XBAR_SEL6_SEL13(x)                       (((uint16_t)(((uint16_t)(x)) << XBAR_SEL6_SEL13_SHIFT)) & XBAR_SEL6_SEL13_MASK)
/*! @} */

/*! @name SEL7 - Crossbar Select Register 7 */
/*! @{ */

#define XBAR_SEL7_SEL14_MASK                     (0x3FU)
#define XBAR_SEL7_SEL14_SHIFT                    (0U)
/*! SEL14
 *  0b000000..Logic 1 (VDD)
 *  0b000001..Logic 0 (VSS)
 *  0b000010..AFE modulator clock output
 *  0b000011..AFE modulator 0 data output
 *  0b000100..LPTimer Output
 *  0b000101..Clock Output
 *  0b000110..Quad Timer channel 0 output
 *  0b000111..Quad Timer channel 1 output
 *  0b001000..Quad Timer channel 2 output
 *  0b001001..Quad Timer channel 3 output
 *  0b001010..iRTC Clock Output
 *  0b001011..CMP0 Output
 *  0b001100..CMP1 Output
 *  0b001101..iRTC Alarm Output
 *  0b001110..UART TX Output (after modulation)
 *  0b001111..EWM Output (EWM_OUT)
 *  0b010000..PIT 0 Timer Interrupt Flag 0 (Timeout 0)
 *  0b010001..XBAR Input pin 0
 *  0b010010..XBAR Input pin 1
 *  0b010011..XBAR Input pin 2
 *  0b010100..XBAR Input pin 3
 *  0b010101..XBAR Input pin 4
 *  0b010110..XBAR Input pin 5
 *  0b010111..XBAR Input pin 6
 *  0b011000..XBAR Input pin 7
 *  0b011001..XBAR Input pin 8
 *  0b011010..ORed conversion complete flag for all SAR ADC channels
 *  0b011011..ORed conversion complete flag for all AFE channels
 *  0b011100..AFE Channel 0 conversion complete
 *  0b011101..AFE Channel 1 conversion complete
 *  0b011110..AFE Channel 2 conversion complete
 *  0b011111..AFE Channel 3 conversion complete
 *  0b100000..DMA Done Signal
 *  0b100001..XBAR Input pin 9
 *  0b100010..XBAR Input pin 10
 *  0b100011..CMP2 Output
 *  0b100100..PIT 0 Timer Interrupt Flag 1 (Timeout 1)
 *  0b100101..PIT 1 Timer Interrupt Flag 0 (Timeout 0)
 *  0b100110..PIT 1 Timer Interrupt Flag 1 (Timeout 1)
 *  0b100111..AFE modulator 1 data output
 *  0b101000..AFE modulator 2 data output
 *  0b101001..AFE modulator 3 data output
 *  0b101010..SAR ADC conversion complete A
 *  0b101011..SAR ADC conversion complete B
 *  0b101100..SAR ADC conversion complete C
 *  0b101101..SAR ADC conversion complete D
 *  0b101110..PDB0 CH0 Pre-trigger 0
 *  0b101111..PDB0 CH0 Pre-trigger 1
 *  0b110000..PDB0 CH0 Pre-trigger 2
 *  0b110001..PDB0 CH0 Pre-trigger 3
 *  0b110010..PDB0 CH0 Trigger
 *  0b110011..PDB0 Pulse-Out 0
 */
#define XBAR_SEL7_SEL14(x)                       (((uint16_t)(((uint16_t)(x)) << XBAR_SEL7_SEL14_SHIFT)) & XBAR_SEL7_SEL14_MASK)

#define XBAR_SEL7_SEL15_MASK                     (0x3F00U)
#define XBAR_SEL7_SEL15_SHIFT                    (8U)
/*! SEL15
 *  0b000000..Logic 1 (VDD)
 *  0b000001..Logic 0 (VSS)
 *  0b000010..AFE modulator clock output
 *  0b000011..AFE modulator 0 data output
 *  0b000100..LPTimer Output
 *  0b000101..Clock Output
 *  0b000110..Quad Timer channel 0 output
 *  0b000111..Quad Timer channel 1 output
 *  0b001000..Quad Timer channel 2 output
 *  0b001001..Quad Timer channel 3 output
 *  0b001010..iRTC Clock Output
 *  0b001011..CMP0 Output
 *  0b001100..CMP1 Output
 *  0b001101..iRTC Alarm Output
 *  0b001110..UART TX Output (after modulation)
 *  0b001111..EWM Output (EWM_OUT)
 *  0b010000..PIT 0 Timer Interrupt Flag 0 (Timeout 0)
 *  0b010001..XBAR Input pin 0
 *  0b010010..XBAR Input pin 1
 *  0b010011..XBAR Input pin 2
 *  0b010100..XBAR Input pin 3
 *  0b010101..XBAR Input pin 4
 *  0b010110..XBAR Input pin 5
 *  0b010111..XBAR Input pin 6
 *  0b011000..XBAR Input pin 7
 *  0b011001..XBAR Input pin 8
 *  0b011010..ORed conversion complete flag for all SAR ADC channels
 *  0b011011..ORed conversion complete flag for all AFE channels
 *  0b011100..AFE Channel 0 conversion complete
 *  0b011101..AFE Channel 1 conversion complete
 *  0b011110..AFE Channel 2 conversion complete
 *  0b011111..AFE Channel 3 conversion complete
 *  0b100000..DMA Done Signal
 *  0b100001..XBAR Input pin 9
 *  0b100010..XBAR Input pin 10
 *  0b100011..CMP2 Output
 *  0b100100..PIT 0 Timer Interrupt Flag 1 (Timeout 1)
 *  0b100101..PIT 1 Timer Interrupt Flag 0 (Timeout 0)
 *  0b100110..PIT 1 Timer Interrupt Flag 1 (Timeout 1)
 *  0b100111..AFE modulator 1 data output
 *  0b101000..AFE modulator 2 data output
 *  0b101001..AFE modulator 3 data output
 *  0b101010..SAR ADC conversion complete A
 *  0b101011..SAR ADC conversion complete B
 *  0b101100..SAR ADC conversion complete C
 *  0b101101..SAR ADC conversion complete D
 *  0b101110..PDB0 CH0 Pre-trigger 0
 *  0b101111..PDB0 CH0 Pre-trigger 1
 *  0b110000..PDB0 CH0 Pre-trigger 2
 *  0b110001..PDB0 CH0 Pre-trigger 3
 *  0b110010..PDB0 CH0 Trigger
 *  0b110011..PDB0 Pulse-Out 0
 */
#define XBAR_SEL7_SEL15(x)                       (((uint16_t)(((uint16_t)(x)) << XBAR_SEL7_SEL15_SHIFT)) & XBAR_SEL7_SEL15_MASK)
/*! @} */

/*! @name SEL8 - Crossbar Select Register 8 */
/*! @{ */

#define XBAR_SEL8_SEL16_MASK                     (0x3FU)
#define XBAR_SEL8_SEL16_SHIFT                    (0U)
/*! SEL16
 *  0b000000..Logic 1 (VDD)
 *  0b000001..Logic 0 (VSS)
 *  0b000010..AFE modulator clock output
 *  0b000011..AFE modulator 0 data output
 *  0b000100..LPTimer Output
 *  0b000101..Clock Output
 *  0b000110..Quad Timer channel 0 output
 *  0b000111..Quad Timer channel 1 output
 *  0b001000..Quad Timer channel 2 output
 *  0b001001..Quad Timer channel 3 output
 *  0b001010..iRTC Clock Output
 *  0b001011..CMP0 Output
 *  0b001100..CMP1 Output
 *  0b001101..iRTC Alarm Output
 *  0b001110..UART TX Output (after modulation)
 *  0b001111..EWM Output (EWM_OUT)
 *  0b010000..PIT 0 Timer Interrupt Flag 0 (Timeout 0)
 *  0b010001..XBAR Input pin 0
 *  0b010010..XBAR Input pin 1
 *  0b010011..XBAR Input pin 2
 *  0b010100..XBAR Input pin 3
 *  0b010101..XBAR Input pin 4
 *  0b010110..XBAR Input pin 5
 *  0b010111..XBAR Input pin 6
 *  0b011000..XBAR Input pin 7
 *  0b011001..XBAR Input pin 8
 *  0b011010..ORed conversion complete flag for all SAR ADC channels
 *  0b011011..ORed conversion complete flag for all AFE channels
 *  0b011100..AFE Channel 0 conversion complete
 *  0b011101..AFE Channel 1 conversion complete
 *  0b011110..AFE Channel 2 conversion complete
 *  0b011111..AFE Channel 3 conversion complete
 *  0b100000..DMA Done Signal
 *  0b100001..XBAR Input pin 9
 *  0b100010..XBAR Input pin 10
 *  0b100011..CMP2 Output
 *  0b100100..PIT 0 Timer Interrupt Flag 1 (Timeout 1)
 *  0b100101..PIT 1 Timer Interrupt Flag 0 (Timeout 0)
 *  0b100110..PIT 1 Timer Interrupt Flag 1 (Timeout 1)
 *  0b100111..AFE modulator 1 data output
 *  0b101000..AFE modulator 2 data output
 *  0b101001..AFE modulator 3 data output
 *  0b101010..SAR ADC conversion complete A
 *  0b101011..SAR ADC conversion complete B
 *  0b101100..SAR ADC conversion complete C
 *  0b101101..SAR ADC conversion complete D
 *  0b101110..PDB0 CH0 Pre-trigger 0
 *  0b101111..PDB0 CH0 Pre-trigger 1
 *  0b110000..PDB0 CH0 Pre-trigger 2
 *  0b110001..PDB0 CH0 Pre-trigger 3
 *  0b110010..PDB0 CH0 Trigger
 *  0b110011..PDB0 Pulse-Out 0
 */
#define XBAR_SEL8_SEL16(x)                       (((uint16_t)(((uint16_t)(x)) << XBAR_SEL8_SEL16_SHIFT)) & XBAR_SEL8_SEL16_MASK)

#define XBAR_SEL8_SEL17_MASK                     (0x3F00U)
#define XBAR_SEL8_SEL17_SHIFT                    (8U)
/*! SEL17
 *  0b000000..Logic 1 (VDD)
 *  0b000001..Logic 0 (VSS)
 *  0b000010..AFE modulator clock output
 *  0b000011..AFE modulator 0 data output
 *  0b000100..LPTimer Output
 *  0b000101..Clock Output
 *  0b000110..Quad Timer channel 0 output
 *  0b000111..Quad Timer channel 1 output
 *  0b001000..Quad Timer channel 2 output
 *  0b001001..Quad Timer channel 3 output
 *  0b001010..iRTC Clock Output
 *  0b001011..CMP0 Output
 *  0b001100..CMP1 Output
 *  0b001101..iRTC Alarm Output
 *  0b001110..UART TX Output (after modulation)
 *  0b001111..EWM Output (EWM_OUT)
 *  0b010000..PIT 0 Timer Interrupt Flag 0 (Timeout 0)
 *  0b010001..XBAR Input pin 0
 *  0b010010..XBAR Input pin 1
 *  0b010011..XBAR Input pin 2
 *  0b010100..XBAR Input pin 3
 *  0b010101..XBAR Input pin 4
 *  0b010110..XBAR Input pin 5
 *  0b010111..XBAR Input pin 6
 *  0b011000..XBAR Input pin 7
 *  0b011001..XBAR Input pin 8
 *  0b011010..ORed conversion complete flag for all SAR ADC channels
 *  0b011011..ORed conversion complete flag for all AFE channels
 *  0b011100..AFE Channel 0 conversion complete
 *  0b011101..AFE Channel 1 conversion complete
 *  0b011110..AFE Channel 2 conversion complete
 *  0b011111..AFE Channel 3 conversion complete
 *  0b100000..DMA Done Signal
 *  0b100001..XBAR Input pin 9
 *  0b100010..XBAR Input pin 10
 *  0b100011..CMP2 Output
 *  0b100100..PIT 0 Timer Interrupt Flag 1 (Timeout 1)
 *  0b100101..PIT 1 Timer Interrupt Flag 0 (Timeout 0)
 *  0b100110..PIT 1 Timer Interrupt Flag 1 (Timeout 1)
 *  0b100111..AFE modulator 1 data output
 *  0b101000..AFE modulator 2 data output
 *  0b101001..AFE modulator 3 data output
 *  0b101010..SAR ADC conversion complete A
 *  0b101011..SAR ADC conversion complete B
 *  0b101100..SAR ADC conversion complete C
 *  0b101101..SAR ADC conversion complete D
 *  0b101110..PDB0 CH0 Pre-trigger 0
 *  0b101111..PDB0 CH0 Pre-trigger 1
 *  0b110000..PDB0 CH0 Pre-trigger 2
 *  0b110001..PDB0 CH0 Pre-trigger 3
 *  0b110010..PDB0 CH0 Trigger
 *  0b110011..PDB0 Pulse-Out 0
 */
#define XBAR_SEL8_SEL17(x)                       (((uint16_t)(((uint16_t)(x)) << XBAR_SEL8_SEL17_SHIFT)) & XBAR_SEL8_SEL17_MASK)
/*! @} */

